import React from 'react';

const Greeting = (): JSX.Element => (
  <div>
    <p>Приветствую!</p>
    <p>Меня зовут Юрий Романов.</p>
    <p>Занимаюсь web-разработкой, направление: frontend.</p>
    <p>На этом сайте я планирую выкладывать свои проекты, которые пишу в свободное время.</p>
    <p>
      В данный момент пишу код с использованием библиотеки React и сопутствующими ей технологиями (React-router, Redux
      etc...)
    </p>
    <p>Используйте терминал чтобы узнать больше =)</p>
    <p>Введите help для просмотра доступных комманд...</p>
  </div>
);

export default Greeting;
